artillery/load-test.yml
config:
  target: "http://nginx:80"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Ramp-up"
    - duration: 60
      arrivalRate: 1000
      name: "Carga sostenida 1000 usuarios"
    - duration: 20
      arrivalRate: 10
      name: "Enfriamiento"

scenarios:
  - name: "Consulta de productos del inventario"
    flow:
      - get:
          url: "/api/productos"
          expect:
            - statusCode: 200