artillery/load-test.yml
config:
  target: "http://nginx:80"
  phases:
    # Fase 1: calentamiento (ramp-up)
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: "Ramp-up"
    # Fase 2: carga sostenida (1000 usuarios concurrentes durante 60s)
    - duration: 60
      arrivalRate: 1000
      name: "Carga sostenida"
    # Fase 3: enfriamiento
    - duration: 20
      arrivalRate: 10
      name: "Enfriamiento"

scenarios:
  - name: "Solicitud básica al balanceador"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200